<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use App\Models\ReportCollection;

class ReportCollectionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['68202841043000', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['68202841043000', 'التوزيع الحديث التجارية'],
            ['68202841043000', 'التوزيع الحديث التجارية'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['62500000065500', 'التوزيع الحديث التجارية'],
            ['678000010006080000000', 'التوزيع الحديث التجارية'],
            ['62517130000203', 'عصر الجوال للتجارة'],
            ['62500000065500', 'التوزيع الحديث التجارية']
        ];

        foreach ($data as $row) {
            $accountNumber = $row[0];
            $accountName = $row[1];

            ReportCollection::orderBy('UserID')
                            ->whereNotNull('UserID') // Adjust the column for ordering or remove if not needed
                            ->chunk(100, function ($reportCollections) use ($accountNumber, $accountName) {
                                foreach ($reportCollections as $reportCollection) {
                                    $reportCollection->update([
                                        'account_number' => $accountNumber,
                                        'account_name' => $accountName,
                                    ]);
                                }
                            });
        }
    }
}
